cases/channelHartmannPeriodic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pB
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

    "(U|B)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;

    // streamwise periodicity makes the p equation purely Neumann, so its
    // level must be fixed as well
    pRefCell        0;
    pRefValue       0;
}

BPISO
{
    nCorrectors     3;

    // Required here: with cyclic inlet/outlet and zeroGradient walls every pB
    // boundary is Neumann, so the pB equation is singular and its level must
    // be fixed.  Without these two entries the solver dies with a singular
    // matrix / floating point exception.
    pBRefCell       0;
    pBRefValue      0;
}


// ************************************************************************* //
